#### Ordinal Number Encoding 

###### Where the categories can be ordered in such a way where you can assign Ranks to the category. 
###### In ordinal encoding, each unique category value is assigned an integer value.
###### For example, “red” is 1, “green” is 2, and “blue” is 3.
###### This is called an ordinal encoding or an integer encoding and is easily reversible. Often, integer values starting at zero are used.

In [48]:
import datetime
from datetime import timedelta

In [49]:
today_date=datetime.datetime.today()

In [50]:
today_date

datetime.datetime(2020, 9, 29, 21, 54, 41, 93521)

In [51]:
datetime.timedelta(3)

datetime.timedelta(days=3)

In [52]:
today_date-datetime.timedelta(3)

datetime.datetime(2020, 9, 26, 21, 54, 41, 93521)

In [53]:
today_date+datetime.timedelta(3)

datetime.datetime(2020, 10, 2, 21, 54, 41, 93521)

In [54]:
#### List Comprehension
days=[today_date-datetime.timedelta(x) for x in range(0,15)]

In [55]:
days

[datetime.datetime(2020, 9, 29, 21, 54, 41, 93521),
 datetime.datetime(2020, 9, 28, 21, 54, 41, 93521),
 datetime.datetime(2020, 9, 27, 21, 54, 41, 93521),
 datetime.datetime(2020, 9, 26, 21, 54, 41, 93521),
 datetime.datetime(2020, 9, 25, 21, 54, 41, 93521),
 datetime.datetime(2020, 9, 24, 21, 54, 41, 93521),
 datetime.datetime(2020, 9, 23, 21, 54, 41, 93521),
 datetime.datetime(2020, 9, 22, 21, 54, 41, 93521),
 datetime.datetime(2020, 9, 21, 21, 54, 41, 93521),
 datetime.datetime(2020, 9, 20, 21, 54, 41, 93521),
 datetime.datetime(2020, 9, 19, 21, 54, 41, 93521),
 datetime.datetime(2020, 9, 18, 21, 54, 41, 93521),
 datetime.datetime(2020, 9, 17, 21, 54, 41, 93521),
 datetime.datetime(2020, 9, 16, 21, 54, 41, 93521),
 datetime.datetime(2020, 9, 15, 21, 54, 41, 93521)]

In [56]:
### Creating a dataframe for 15 days. 
import pandas as pd 
data=pd.DataFrame(days)

In [57]:
data

                            0
0  2020-09-29 21:54:41.093521
1  2020-09-28 21:54:41.093521
2  2020-09-27 21:54:41.093521
3  2020-09-26 21:54:41.093521
4  2020-09-25 21:54:41.093521
5  2020-09-24 21:54:41.093521
6  2020-09-23 21:54:41.093521
7  2020-09-22 21:54:41.093521
8  2020-09-21 21:54:41.093521
9  2020-09-20 21:54:41.093521
10 2020-09-19 21:54:41.093521
11 2020-09-18 21:54:41.093521
12 2020-09-17 21:54:41.093521
13 2020-09-16 21:54:41.093521
14 2020-09-15 21:54:41.093521

In [58]:
#### giving a column name. 
data.columns=["Day"]

In [59]:
data.head()

                         Day
0 2020-09-29 21:54:41.093521
1 2020-09-28 21:54:41.093521
2 2020-09-27 21:54:41.093521
3 2020-09-26 21:54:41.093521
4 2020-09-25 21:54:41.093521

In [60]:
### We can get the specific things what we need from these data. 
### We can get the mintues, days, weekday, year and all sorts of date and time related information from our dataset.
### Refer to Python datetime Library to know what more can be done.

In [61]:
data['Day'].dt.weekday

0     1
1     0
2     6
3     5
4     4
5     3
6     2
7     1
8     0
9     6
10    5
11    4
12    3
13    2
14    1
Name: Day, dtype: int64

In [62]:
data['Day'].dt.month

0     9
1     9
2     9
3     9
4     9
5     9
6     9
7     9
8     9
9     9
10    9
11    9
12    9
13    9
14    9
Name: Day, dtype: int64

In [63]:
data['Day'].dt.hour

0     21
1     21
2     21
3     21
4     21
5     21
6     21
7     21
8     21
9     21
10    21
11    21
12    21
13    21
14    21
Name: Day, dtype: int64

In [64]:
data['Day'].dt.year

0     2020
1     2020
2     2020
3     2020
4     2020
5     2020
6     2020
7     2020
8     2020
9     2020
10    2020
11    2020
12    2020
13    2020
14    2020
Name: Day, dtype: int64

In [71]:
data['weekday']=data['Day'].dt.weekday
data.head()

                         Day  weekday
0 2020-09-29 21:54:41.093521        1
1 2020-09-28 21:54:41.093521        0
2 2020-09-27 21:54:41.093521        6
3 2020-09-26 21:54:41.093521        5
4 2020-09-25 21:54:41.093521        4

In [81]:
dictionary={0:'Monday',1:'Tuesday',2:'Wednesday',3:'Thursday',4:'Friday',5:'Saturday',6:'Sunday'
    
    
}

In [82]:
dictionary

{0: 'Monday',
 1: 'Tuesday',
 2: 'Wednesday',
 3: 'Thursday',
 4: 'Friday',
 5: 'Saturday',
 6: 'Sunday'}

In [83]:
data['weekday_ordinal']=data['weekday'].map(dictionary)

In [84]:
data

                          Day  weekday weekday_ordinal
0  2020-09-29 21:54:41.093521        1         Tuesday
1  2020-09-28 21:54:41.093521        0          Monday
2  2020-09-27 21:54:41.093521        6          Sunday
3  2020-09-26 21:54:41.093521        5        Saturday
4  2020-09-25 21:54:41.093521        4          Friday
5  2020-09-24 21:54:41.093521        3        Thursday
6  2020-09-23 21:54:41.093521        2       Wednesday
7  2020-09-22 21:54:41.093521        1         Tuesday
8  2020-09-21 21:54:41.093521        0          Monday
9  2020-09-20 21:54:41.093521        6          Sunday
10 2020-09-19 21:54:41.093521        5        Saturday
11 2020-09-18 21:54:41.093521        4          Friday
12 2020-09-17 21:54:41.093521        3        Thursday
13 2020-09-16 21:54:41.093521        2       Wednesday
14 2020-09-15 21:54:41.093521        1         Tuesday

#### Count Or Frequency Encoding

In [109]:
train_set = pd.read_csv('http://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data' , header = None,index_col=None)
train_set.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [110]:
columns=[1,3,5,6,7,8,9,13]

In [111]:
train_set=train_set[columns]

In [112]:
### provding heading to all the columns.
train_set.columns=['Employment','Degree','Status','Designation','family_job','Race','Sex','Country']

In [113]:
train_set.head()

,Employment,Degree,Status,Designation,family_job,Race,Sex,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,United-States
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,United-States
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,United-States
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,United-States
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,Cuba

In [114]:
for feature in train_set.columns[:]:
    print(feature,":",len(train_set[feature].unique()),'labels')

Employment : 9 labels
Degree : 16 labels
Status : 7 labels
Designation : 15 labels
family_job : 6 labels
Race : 5 labels
Sex : 2 labels
Country : 42 labels

In [115]:
train_set['Country'].value_counts().to_dict()
## converting into dictionary

{' United-States': 29170,
 ' Mexico': 643,
 ' ?': 583,
 ' Philippines': 198,
 ' Germany': 137,
 ' Canada': 121,
 ' Puerto-Rico': 114,
 ' El-Salvador': 106,
 ' India': 100,
 ' Cuba': 95,
 ' England': 90,
 ' Jamaica': 81,
 ' South': 80,
 ' China': 75,
 ' Italy': 73,
 ' Dominican-Republic': 70,
 ' Vietnam': 67,
 ' Guatemala': 64,
 ' Japan': 62,
 ' Poland': 60,
 ' Columbia': 59,
 ' Taiwan': 51,
 ' Haiti': 44,
 ' Iran': 43,
 ' Portugal': 37,
 ' Nicaragua': 34,
 ' Peru': 31,
 ' France': 29,
 ' Greece': 29,
 ' Ecuador': 28,
 ' Ireland': 24,
 ' Hong': 20,
 ' Cambodia': 19,
 ' Trinadad&Tobago': 19,
 ' Thailand': 18,
 ' Laos': 18,
 ' Yugoslavia': 16,
 ' Outlying-US(Guam-USVI-etc)': 14,
 ' Hungary': 13,
 ' Honduras': 13,
 ' Scotland': 12,
 ' Holand-Netherlands': 1}

In [116]:
country_map=train_set['Country'].value_counts().to_dict()

In [117]:
train_set['Country']=train_set['Country'].map(country_map)
train_set.head(20)

,Employment,Degree,Status,Designation,family_job,Race,Sex,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,29170
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,29170
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,29170
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,29170
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,95
5,Private,Masters,Married-civ-spouse,Exec-managerial,Wife,White,Female,29170
6,Private,9th,Married-spouse-absent,Other-service,Not-in-family,Black,Female,81
7,Self-emp-not-inc,HS-grad,Married-civ-spouse,Exec-managerial,Husband,White,Male,29170
8,Private,Masters,Never-married,Prof-specialty,Not-in-family,White,Female,29170
9,Private,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,29170
10,Private,Some-college,Married-civ-spouse,Exec-managerial,Husband,Black,Male,29170
11,State-gov,Bachelors,Married-civ-spouse,Prof-specialty,Husband,Asian-Pac-Islander,Male,100
12,Private,Bachelors,Never-married,Adm-clerical,Own-child,White,Female,29170
13,Private,Assoc-acdm,Never-married,Sales,Not-in-family,Black,Male,29170
14,Private,Assoc-voc,Married-civ-spouse,Craft-repair,Husband,Asian-Pac-Islander,Male,583
15,Private,7th-8th,Married-civ-spouse,Transport-moving,Husband,Amer-Indian-Eskimo,Male,643
16,Self-emp-not-inc,HS-grad,Never-married,Farming-fishing,Own-child,White,Male,29170
17,Private,HS-grad,Never-married,Machine-op-inspct,Unmarried,White,Male,29170
18,Private,11th,Married-civ-spouse,Sales,Husband,White,Male,29170
19,Self-emp-not-inc,Masters,Divorced,Exec-managerial,Unmarried,White,Female,29170

### Advantages
1. Easy To Use
2. Not increasing feature space
### Disadvantages 
1. It will provide same weight if the frequencies are same

##### Target Guided Ordinal Encoding
1. Ordering the labels according to the target
2. Replace the labels by the joint probability of being 1 or 0

In [118]:
import pandas as pd
df=pd.read_csv('titanic.csv', usecols=['Cabin','Survived'])
df.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [120]:
df['Cabin'].fillna('Missing',inplace=True)
df.head()

   Survived    Cabin
0         0  Missing
1         1      C85
2         1  Missing
3         1     C123
4         0  Missing

In [121]:
### Targeting the first letter from the Cabin. 
df['Cabin'].astype(str).str[0]

0      M
1      C
2      M
3      C
4      M
      ..
886    M
887    B
888    M
889    C
890    M
Name: Cabin, Length: 891, dtype: object

In [122]:
df['Cabin']=df['Cabin'].astype(str).str[0]
df.head()

   Survived Cabin
0         0     M
1         1     C
2         1     M
3         1     C
4         0     M

In [123]:
df.Cabin.unique()

array(['M', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T'], dtype=object)

In [124]:
df.groupby(['Cabin'])['Survived'].mean()

Cabin
A    0.466667
B    0.744681
C    0.593220
D    0.757576
E    0.750000
F    0.615385
G    0.500000
M    0.299854
T    0.000000
Name: Survived, dtype: float64

In [126]:
df.groupby(['Cabin'])['Survived'].mean().sort_values()

Cabin
T    0.000000
M    0.299854
A    0.466667
G    0.500000
C    0.593220
F    0.615385
B    0.744681
E    0.750000
D    0.757576
Name: Survived, dtype: float64

In [127]:
df.groupby(['Cabin'])['Survived'].mean().sort_values().index

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [129]:
ordinal_labels=df.groupby(['Cabin'])['Survived'].mean().sort_values().index
ordinal_labels

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [130]:
enumerate(ordinal_labels,0)

In [131]:
ordinal_labels2={k:i for i,k in enumerate(ordinal_labels,0)}
ordinal_labels2

{'T': 0, 'M': 1, 'A': 2, 'G': 3, 'C': 4, 'F': 5, 'B': 6, 'E': 7, 'D': 8}

In [132]:
df['Cabin_ordinal_labels']=df['Cabin'].map(ordinal_labels2)
df.head()

   Survived Cabin  Cabin_ordinal_labels
0         0     M                     1
1         1     C                     4
2         1     M                     1
3         1     C                     4
4         0     M                     1

#### Mean Encoding

In [133]:
mean_ordinal=df.groupby(['Cabin'])['Survived'].mean().to_dict()

In [134]:
mean_ordinal

{'A': 0.4666666666666667,
 'B': 0.7446808510638298,
 'C': 0.5932203389830508,
 'D': 0.7575757575757576,
 'E': 0.75,
 'F': 0.6153846153846154,
 'G': 0.5,
 'M': 0.29985443959243085,
 'T': 0.0}

In [135]:
df['mean_ordinal_encode']=df['Cabin'].map(mean_ordinal)
df.head()

   Survived Cabin  Cabin_ordinal_labels  mean_ordinal_encode
0         0     M                     1             0.299854
1         1     C                     4             0.593220
2         1     M                     1             0.299854
3         1     C                     4             0.593220
4         0     M                     1             0.299854

### Probability Ratio Encoding

1. Probability of Survived based on Cabin--- Categorical Feature
2. Probability of Not Survived---1-pr(Survived)
3. pr(Survived)/pr(Not Survived)
4. Dictonary to map cabin with probability
5. Replace with the categorical feature

In [2]:
import pandas as pd
df=pd.read_csv('titanic.csv',usecols=['Cabin','Survived'])
df.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [3]:
### Replacing
df['Cabin'].fillna('Missing',inplace=True)
df.head()

   Survived    Cabin
0         0  Missing
1         1      C85
2         1  Missing
3         1     C123
4         0  Missing

In [4]:
df['Cabin'].unique()

array(['Missing', 'C85', 'C123', 'E46', 'G6', 'C103', 'D56', 'A6',
       'C23 C25 C27', 'B78', 'D33', 'B30', 'C52', 'B28', 'C83', 'F33',
       'F G73', 'E31', 'A5', 'D10 D12', 'D26', 'C110', 'B58 B60', 'E101',
       'F E69', 'D47', 'B86', 'F2', 'C2', 'E33', 'B19', 'A7', 'C49', 'F4',
       'A32', 'B4', 'B80', 'A31', 'D36', 'D15', 'C93', 'C78', 'D35',
       'C87', 'B77', 'E67', 'B94', 'C125', 'C99', 'C118', 'D7', 'A19',
       'B49', 'D', 'C22 C26', 'C106', 'C65', 'E36', 'C54',
       'B57 B59 B63 B66', 'C7', 'E34', 'C32', 'B18', 'C124', 'C91', 'E40',
       'T', 'C128', 'D37', 'B35', 'E50', 'C82', 'B96 B98', 'E10', 'E44',
       'A34', 'C104', 'C111', 'C92', 'E38', 'D21', 'E12', 'E63', 'A14',
       'B37', 'C30', 'D20', 'B79', 'E25', 'D46', 'B73', 'C95', 'B38',
       'B39', 'B22', 'C86', 'C70', 'A16', 'C101', 'C68', 'A10', 'E68',
       'B41', 'A20', 'D19', 'D50', 'D9', 'A23', 'B50', 'A26', 'D48',
       'E58', 'C126', 'B71', 'B51 B53 B55', 'D49', 'B5', 'B20', 'F G63',
       'C62 C64', 'E24', 'C90', 'C45', 'E8', 'B101', 'D45', 'C46', 'D30',
       'E121', 'D11', 'E77', 'F38', 'B3', 'D6', 'B82 B84', 'D17', 'A36',
       'B102', 'B69', 'E49', 'C47', 'D28', 'E17', 'A24', 'C50', 'B42',
       'C148'], dtype=object)

In [5]:
df.head(20)

    Survived    Cabin
0          0  Missing
1          1      C85
2          1  Missing
3          1     C123
4          0  Missing
5          0  Missing
6          0      E46
7          0  Missing
8          1  Missing
9          1  Missing
10         1       G6
11         1     C103
12         0  Missing
13         0  Missing
14         0  Missing
15         1  Missing
16         0  Missing
17         1  Missing
18         0  Missing
19         1  Missing

In [6]:
df['Cabin']=df['Cabin'].astype(str).str[0]
df.head()

   Survived Cabin
0         0     M
1         1     C
2         1     M
3         1     C
4         0     M

In [7]:
df.Cabin.unique()

array(['M', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T'], dtype=object)

In [8]:
prob_df=df.groupby(['Cabin'])['Survived'].mean()

In [9]:
### creating a dataframe
prob_df=pd.DataFrame(prob_df)
prob_df

       Survived
Cabin
A      0.466667
B      0.744681
C      0.593220
D      0.757576
E      0.750000
F      0.615385
G      0.500000
M      0.299854
T      0.000000

In [10]:
prob_df['Died']=1-prob_df['Survived']

In [11]:
prob_df.head()

       Survived      Died
Cabin
A      0.466667  0.533333
B      0.744681  0.255319
C      0.593220  0.406780
D      0.757576  0.242424
E      0.750000  0.250000

In [12]:
### Probability Ratio=Survived/died
prob_df['Probability_ratio']=prob_df['Survived']/prob_df['Died']
prob_df.head()

       Survived      Died  Probability_ratio
Cabin
A      0.466667  0.533333           0.875000
B      0.744681  0.255319           2.916667
C      0.593220  0.406780           1.458333
D      0.757576  0.242424           3.125000
E      0.750000  0.250000           3.000000

In [13]:
probability_encoded=prob_df['Probability_ratio'].to_dict()

In [15]:
probability_encoded

{'A': 0.875,
 'B': 2.916666666666666,
 'C': 1.4583333333333333,
 'D': 3.125,
 'E': 3.0,
 'F': 1.6000000000000003,
 'G': 1.0,
 'M': 0.42827442827442824,
 'T': 0.0}

In [16]:
df['Cabin_encoded']=df['Cabin'].map(probability_encoded)

In [17]:
df.head(20)

    Survived Cabin  Cabin_encoded
0          0     M       0.428274
1          1     C       1.458333
2          1     M       0.428274
3          1     C       1.458333
4          0     M       0.428274
5          0     M       0.428274
6          0     E       3.000000
7          0     M       0.428274
8          1     M       0.428274
9          1     M       0.428274
10         1     G       1.000000
11         1     C       1.458333
12         0     M       0.428274
13         0     M       0.428274
14         0     M       0.428274
15         1     M       0.428274
16         0     M       0.428274
17         1     M       0.428274
18         0     M       0.428274
19         1     M       0.428274

In [18]:
### now we can drop the Cabin column and use the probability_encoded to model.